weedmanu/STM32_Libraries/STM32_BME680/STM32_BME680.c
#include "STM32_BME680.h"

// Handler I2C
static I2C_HandleTypeDef *s_bme680_i2c_handle = NULL;

// Fonctions de communication I2C
static int8_t stm32_bme680_i2c_read(uint8_t dev_id, uint8_t reg_addr, uint8_t *data, uint16_t len)
{
    if (s_bme680_i2c_handle == NULL)
        return BME680_E_NULL_PTR;
    if (HAL_I2C_Mem_Read(s_bme680_i2c_handle, (uint16_t)(dev_id << 1), reg_addr, I2C_MEMADD_SIZE_8BIT, data, len, HAL_MAX_DELAY) == HAL_OK)
    {
        return BME680_OK;
    }
    return BME680_E_COM_FAIL;
}
static int8_t stm32_bme680_i2c_write(uint8_t dev_id, uint8_t reg_addr, uint8_t *data, uint16_t len)
{
    if (s_bme680_i2c_handle == NULL)
        return BME680_E_NULL_PTR;
    if (HAL_I2C_Mem_Write(s_bme680_i2c_handle, (uint16_t)(dev_id << 1), reg_addr, I2C_MEMADD_SIZE_8BIT, data, len, HAL_MAX_DELAY) == HAL_OK)
    {
        return BME680_OK;
    }
    return BME680_E_COM_FAIL;
}

// Fonctions utilitaires générales
static int8_t null_ptr_check(const struct bme680_dev *dev)
{
    int8_t status;

    if ((dev == NULL) || (dev->read == NULL) || (dev->write == NULL) || (dev->delay_ms == NULL))
    {
        status = BME680_E_NULL_PTR;
    }
    else
    {
        status = BME680_OK;
    }

    return status;
}
static int8_t boundary_check(uint8_t *value, uint8_t min, uint8_t max, struct bme680_dev *dev)
{
    int8_t status = BME680_OK;

    if (value != NULL)
    {
        if (*value < min)
        {
            *value = min;
            dev->info_msg |= BME680_I_MIN_CORRECTION;
        }
        if (*value > max)
        {
            *value = max;
            dev->info_msg |= BME680_I_MAX_CORRECTION;
        }
    }
    else
    {
        status = BME680_E_NULL_PTR;
    }

    return status;
}
static uint16_t calculate_tph_measurement_duration(const struct bme680_dev *dev)
{
    uint32_t tph_dur_us; /* Duration in microseconds */
    uint32_t meas_cycles;
    uint8_t os_to_meas_cycles[6] = {0, 1, 2, 4, 8, 16}; /* Values from Bosch BME680 driver */

    if (dev == NULL)
    {
        return 0; /* Or handle error appropriately */
    }

    meas_cycles = os_to_meas_cycles[dev->tph_sett.os_temp];
    meas_cycles += os_to_meas_cycles[dev->tph_sett.os_pres];
    meas_cycles += os_to_meas_cycles[dev->tph_sett.os_hum];

    /* Calculation based on BME680 datasheet section 3.2.4 "Measurement duration" and Bosch driver logic */
    tph_dur_us = meas_cycles * UINT32_C(1963); /* Base measurement time per cycle in us */
    tph_dur_us += UINT32_C(477 * 4);           /* Typical ADC setup time for T & P (477us * 4 for oversampling factors) - approximation */
    tph_dur_us += UINT32_C(477 * 5);           /* Typical ADC setup time for H (477us * 5 for oversampling factors) - approximation */
    tph_dur_us += UINT32_C(500);               /* Typical filter processing time in us */

    /* Convert to milliseconds, rounding up */
    return (uint16_t)((tph_dur_us + 999) / 1000 + 1); /* Add 1ms as a safety margin or for rounding, as in original code */
}

// Fonctions de calcul
static float calc_temperature(uint32_t temp_adc, struct bme680_dev *dev)
{
    float var1 = 0;
    float var2 = 0;
    float calc_temp = 0;

    var1 = ((((float)temp_adc / 16384.0f) - ((float)dev->calib.par_t1 / 1024.0f)) * ((float)dev->calib.par_t2));

    var2 = (((((float)temp_adc / 131072.0f) - ((float)dev->calib.par_t1 / 8192.0f)) *
             (((float)temp_adc / 131072.0f) - ((float)dev->calib.par_t1 / 8192.0f))) *
            ((float)dev->calib.par_t3 * 16.0f));

    dev->calib.t_fine = (var1 + var2);

    calc_temp = ((dev->calib.t_fine) / 5120.0f);

    return calc_temp;
}
static float calc_pressure(uint32_t pres_adc, const struct bme680_dev *dev)
{
    float var1 = 0;
    float var2 = 0;
    float var3 = 0;
    float calc_pres = 0;

    var1 = (((float)dev->calib.t_fine / 2.0f) - 64000.0f);
    var2 = var1 * var1 * (((float)dev->calib.par_p6) / (131072.0f));
    var2 = var2 + (var1 * ((float)dev->calib.par_p5) * 2.0f);
    var2 = (var2 / 4.0f) + (((float)dev->calib.par_p4) * 65536.0f);
    var1 = (((((float)dev->calib.par_p3 * var1 * var1) / 16384.0f) + ((float)dev->calib.par_p2 * var1)) / 524288.0f);
    var1 = ((1.0f + (var1 / 32768.0f)) * ((float)dev->calib.par_p1));
    calc_pres = (1048576.0f - ((float)pres_adc));

    if ((int)var1 != 0)
    {
        calc_pres = (((calc_pres - (var2 / 4096.0f)) * 6250.0f) / var1);
        var1 = (((float)dev->calib.par_p9) * calc_pres * calc_pres) / 2147483648.0f;
        var2 = calc_pres * (((float)dev->calib.par_p8) / 32768.0f);
        var3 = ((calc_pres / 256.0f) * (calc_pres / 256.0f) * (calc_pres / 256.0f) * (dev->calib.par_p10 / 131072.0f));
        calc_pres = (calc_pres + (var1 + var2 + var3 + ((float)dev->calib.par_p7 * 128.0f)) / 16.0f);
    }
    else
    {
        calc_pres = 0;
    }

    return calc_pres;
}
static float calc_humidity(uint16_t hum_adc, const struct bme680_dev *dev)
{
    float calc_hum = 0;
    float var1 = 0;
    float var2 = 0;
    float var3 = 0;
    float var4 = 0;
    float temp_comp;

    temp_comp = ((dev->calib.t_fine) / 5120.0f);

    var1 = (float)((float)hum_adc) - (((float)dev->calib.par_h1 * 16.0f) + (((float)dev->calib.par_h3 / 2.0f) * temp_comp));

    var2 = var1 * ((float)(((float)dev->calib.par_h2 / 262144.0f) * (1.0f + (((float)dev->calib.par_h4 / 16384.0f) * temp_comp) + (((float)dev->calib.par_h5 / 1048576.0f) * temp_comp * temp_comp))));

    var3 = (float)dev->calib.par_h6 / 16384.0f;

    var4 = (float)dev->calib.par_h7 / 2097152.0f;

    calc_hum = var2 + ((var3 + (var4 * temp_comp)) * var2 * var2);

    if (calc_hum > 100.0f)
        calc_hum = 100.0f;
    else if (calc_hum < 0.0f)
        calc_hum = 0.0f;

    return calc_hum;
}
static float calc_gas_resistance(uint16_t gas_res_adc, uint8_t gas_range, const struct bme680_dev *dev)
{
    float calc_gas_res;
    float var1 = 0;
    float var2 = 0;
    float var3 = 0;

    const float lookup_k1_range[16] = {
        0.0, 0.0, 0.0, 0.0, 0.0, -1.0, 0.0, -0.8,
        0.0, 0.0, -0.2, -0.5, 0.0, -1.0, 0.0, 0.0};
    const float lookup_k2_range[16] = {
        0.0, 0.0, 0.0, 0.0, 0.1, 0.7, 0.0, -0.8,
        -0.1, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0};

    var1 = (1340.0f + (5.0f * dev->calib.range_sw_err));
    var2 = (var1) * (1.0f + lookup_k1_range[gas_range] / 100.0f);
    var3 = 1.0f + (lookup_k2_range[gas_range] / 100.0f);

