weedmanu/STM32_Libraries/STM32_BME680/STM32_BME680.c
    calc_gas_res = 1.0f / (float)(var3 * (0.000000125f) * (float)(1 << gas_range) * (((((float)gas_res_adc) - 512.0f) / var2) + 1.0f));

    return calc_gas_res;
}
static float calc_heater_res(uint16_t temp, const struct bme680_dev *dev)
{
    float var1 = 0;
    float var2 = 0;
    float var3 = 0;
    float var4 = 0;
    float var5 = 0;
    float res_heat = 0;

    if (temp > 400)
        temp = 400;

    var1 = (((float)dev->calib.par_gh1 / (16.0f)) + 49.0f);
    var2 = ((((float)dev->calib.par_gh2 / (32768.0f)) * (0.0005f)) + 0.00235f);
    var3 = ((float)dev->calib.par_gh3 / (1024.0f));
    var4 = (var1 * (1.0f + (var2 * (float)temp)));
    var5 = (var4 + (var3 * (float)dev->amb_temp));
    res_heat = (uint8_t)(3.4f * ((var5 * (4 / (4 + (float)dev->calib.res_heat_range)) *
                                  (1 / (1 + ((float)dev->calib.res_heat_val * 0.002f)))) -
                                 25));

    return res_heat;
}
static uint8_t calc_heater_dur(uint16_t dur)
{
    uint8_t factor = 0;
    uint8_t durval;

    if (dur >= 0xfc0)
    {
        durval = 0xff;
    }
    else
    {
        while (dur > 0x3F)
        {
            dur = dur / 4;
            factor += 1;
        }
        durval = (uint8_t)(dur + (factor * 64));
    }

    return durval;
}

// Fonctions liées à la configuration
static int8_t read_field_data(struct bme680_field_data *data, struct bme680_dev *dev)
{
    int8_t status;
    uint8_t buff[BME680_FIELD_LENGTH] = {0};
    uint8_t gas_range;
    uint32_t adc_temp;
    uint32_t adc_pres;
    uint16_t adc_hum;
    uint16_t adc_gas_res;
    uint8_t tries = 10;

    status = null_ptr_check(dev);
    do
    {
        if (status == BME680_OK)
        {
            status = bme680_get_regs(((uint8_t)(BME680_FIELD0_ADDR)), buff, (uint16_t)BME680_FIELD_LENGTH,
                                     dev);

            data->status = buff[0] & BME680_NEW_DATA_MSK;
            data->gas_index = buff[0] & BME680_GAS_INDEX_MSK;
            data->meas_index = buff[1];

            adc_pres = (uint32_t)(((uint32_t)buff[2] * 4096) | ((uint32_t)buff[3] * 16) | ((uint32_t)buff[4] / 16));
            adc_temp = (uint32_t)(((uint32_t)buff[5] * 4096) | ((uint32_t)buff[6] * 16) | ((uint32_t)buff[7] / 16));
            adc_hum = (uint16_t)(((uint32_t)buff[8] * 256) | (uint32_t)buff[9]);
            adc_gas_res = (uint16_t)((uint32_t)buff[13] * 4 | (((uint32_t)buff[14]) / 64));
            gas_range = buff[14] & BME680_GAS_RANGE_MSK;

            data->status |= buff[14] & BME680_GASM_VALID_MSK;
            data->status |= buff[14] & BME680_HEAT_STAB_MSK;

            if (data->status & BME680_NEW_DATA_MSK)
            {
                data->temperature = calc_temperature(adc_temp, dev);
                data->pressure = calc_pressure(adc_pres, dev);
                data->humidity = calc_humidity(adc_hum, dev);
                data->gas_resistance = calc_gas_resistance(adc_gas_res, gas_range, dev);
                break;
            }
            dev->delay_ms(BME680_POLL_PERIOD_MS);
        }
        tries--;
    } while (tries);

    if (!tries)
        status = BME680_W_NO_NEW_DATA;

    return status;
}
static int8_t get_calib_data(struct bme680_dev *dev)
{
    int8_t status;
    uint8_t coeff_array[BME680_COEFF_SIZE] = {0};
    uint8_t temp_var = 0;

    status = null_ptr_check(dev);
    if (status == BME680_OK)
    {
        status = bme680_get_regs(BME680_COEFF_ADDR1, coeff_array, BME680_COEFF_ADDR1_LEN, dev);
        if (status == BME680_OK)
            status = bme680_get_regs(BME680_COEFF_ADDR2, &coeff_array[BME680_COEFF_ADDR1_LEN], BME680_COEFF_ADDR2_LEN, dev);

        dev->calib.par_t1 = (uint16_t)(BME680_CONCAT_BYTES(coeff_array[BME680_T1_MSB_REG],
                                                           coeff_array[BME680_T1_LSB_REG]));
        dev->calib.par_t2 = (int16_t)(BME680_CONCAT_BYTES(coeff_array[BME680_T2_MSB_REG],
                                                          coeff_array[BME680_T2_LSB_REG]));
        dev->calib.par_t3 = (int8_t)(coeff_array[BME680_T3_REG]);

        dev->calib.par_p1 = (uint16_t)(BME680_CONCAT_BYTES(coeff_array[BME680_P1_MSB_REG],
                                                           coeff_array[BME680_P1_LSB_REG]));
        dev->calib.par_p2 = (int16_t)(BME680_CONCAT_BYTES(coeff_array[BME680_P2_MSB_REG],
                                                          coeff_array[BME680_P2_LSB_REG]));
        dev->calib.par_p3 = (int8_t)coeff_array[BME680_P3_REG];
        dev->calib.par_p4 = (int16_t)(BME680_CONCAT_BYTES(coeff_array[BME680_P4_MSB_REG],
                                                          coeff_array[BME680_P4_LSB_REG]));
        dev->calib.par_p5 = (int16_t)(BME680_CONCAT_BYTES(coeff_array[BME680_P5_MSB_REG],
                                                          coeff_array[BME680_P5_LSB_REG]));
        dev->calib.par_p6 = (int8_t)(coeff_array[BME680_P6_REG]);
        dev->calib.par_p7 = (int8_t)(coeff_array[BME680_P7_REG]);
        dev->calib.par_p8 = (int16_t)(BME680_CONCAT_BYTES(coeff_array[BME680_P8_MSB_REG],
                                                          coeff_array[BME680_P8_LSB_REG]));
        dev->calib.par_p9 = (int16_t)(BME680_CONCAT_BYTES(coeff_array[BME680_P9_MSB_REG],
                                                          coeff_array[BME680_P9_LSB_REG]));
        dev->calib.par_p10 = (uint8_t)(coeff_array[BME680_P10_REG]);

        dev->calib.par_h1 = (uint16_t)(((uint16_t)coeff_array[BME680_H1_MSB_REG] << BME680_HUM_REG_SHIFT_VAL) | (coeff_array[BME680_H1_LSB_REG] & BME680_BIT_H1_DATA_MSK));
        dev->calib.par_h2 = (uint16_t)(((uint16_t)coeff_array[BME680_H2_MSB_REG] << BME680_HUM_REG_SHIFT_VAL) | ((coeff_array[BME680_H2_LSB_REG]) >> BME680_HUM_REG_SHIFT_VAL));
        dev->calib.par_h3 = (int8_t)coeff_array[BME680_H3_REG];
        dev->calib.par_h4 = (int8_t)coeff_array[BME680_H4_REG];
        dev->calib.par_h5 = (int8_t)coeff_array[BME680_H5_REG];
        dev->calib.par_h6 = (uint8_t)coeff_array[BME680_H6_REG];
        dev->calib.par_h7 = (int8_t)coeff_array[BME680_H7_REG];

        dev->calib.par_gh1 = (int8_t)coeff_array[BME680_GH1_REG];
        dev->calib.par_gh2 = (int16_t)(BME680_CONCAT_BYTES(coeff_array[BME680_GH2_MSB_REG],
                                                           coeff_array[BME680_GH2_LSB_REG]));
        dev->calib.par_gh3 = (int8_t)coeff_array[BME680_GH3_REG];

        if (status == BME680_OK)
        {
            status = bme680_get_regs(BME680_ADDR_RES_HEAT_RANGE_ADDR, &temp_var, 1, dev);

            dev->calib.res_heat_range = ((temp_var & BME680_RHRANGE_MSK) / 16);
            if (status == BME680_OK)
            {
                status = bme680_get_regs(BME680_ADDR_RES_HEAT_VAL_ADDR, &temp_var, 1, dev);

                dev->calib.res_heat_val = (int8_t)temp_var;
                if (status == BME680_OK)
                    status = bme680_get_regs(BME680_ADDR_RANGE_SW_ERR_ADDR, &temp_var, 1, dev);
            }
        }
        dev->calib.range_sw_err = ((int8_t)temp_var & (int8_t)BME680_RSERROR_MSK) / 16;
    }

