weedmanu/STM32_Libraries/STM32_BME680/STM32_BME680.c
    return status;
}
static int8_t set_gas_config(struct bme680_dev *dev)
{
    int8_t status;

    status = null_ptr_check(dev);
    if (status == BME680_OK)
    {

        uint8_t reg_addr[2] = {0};
        uint8_t reg_data[2] = {0};

        if (dev->power_mode == BME680_FORCED_MODE)
        {
            reg_addr[0] = BME680_RES_HEAT0_ADDR;
            reg_data[0] = calc_heater_res(dev->gas_sett.heatr_temp, dev);
            reg_addr[1] = BME680_GAS_WAIT0_ADDR;
            reg_data[1] = calc_heater_dur(dev->gas_sett.heatr_dur);
            dev->gas_sett.nb_conv = 0;
        }
        else
        {
            status = BME680_W_DEFINE_PWR_MODE;
        }
        if (status == BME680_OK)
            status = bme680_set_regs(reg_addr, reg_data, 2, dev);
    }

    return status;
}
static int8_t get_gas_config(struct bme680_dev *dev)
{
    int8_t status;
    uint8_t reg_addr1 = BME680_ADDR_SENS_CONF_START;
    uint8_t reg_addr2 = BME680_ADDR_GAS_CONF_START;
    uint8_t reg_data = 0;

    status = null_ptr_check(dev);
    if (status == BME680_OK)
    {
        status = bme680_get_regs(reg_addr1, &reg_data, 1, dev);
        if (status == BME680_OK)
        {
            dev->gas_sett.heatr_temp = reg_data;
            status = bme680_get_regs(reg_addr2, &reg_data, 1, dev);
            if (status == BME680_OK)
            {
                dev->gas_sett.heatr_dur = reg_data;
            }
        }
    }

    return status;
}
static int8_t apply_initial_configurations(struct bme680_dev *dev, const BME680_InitialSettings *initial_conf)
{
    int8_t status;
    uint16_t desired_settings_mask = BME680_OST_SEL | BME680_OSP_SEL | BME680_OSH_SEL | BME680_FILTER_SEL | BME680_GAS_SENSOR_SEL;

    if (initial_conf == NULL)
    {
        dev->power_mode = BME680_FORCED_MODE;
    }
    else
    {
        dev->tph_sett = initial_conf->tph_sett;
        dev->gas_sett = initial_conf->gas_sett;
        dev->power_mode = initial_conf->power_mode;
    }

    status = bme680_set_sensor_settings(desired_settings_mask, dev);
    if (status != BME680_OK)
    {
        return status;
    }

    return bme680_set_sensor_mode(dev);
}
static int8_t sensor_init(struct bme680_dev *dev, uint8_t i2c_addr, const BME680_InitialSettings *settings)
{
    int8_t status = BME680_E_DEV_NOT_FOUND;
    int attempt_count = 0;

    dev->dev_id = i2c_addr;
    while (attempt_count < 3)
    {
        status = bme680_init(dev);
        if (status == BME680_OK)
        {
            /* Sensor found and basic init OK, now apply further configurations */
            status = apply_initial_configurations(dev, settings);
            return status; /* Return status of apply_initial_configurations */
        }
        attempt_count++;
        dev->delay_ms(100); /* Wait before retrying */
    }
    return status; /* Return last error status after all attempts */
}

// Fonctions de lecture et d'écriture des registres
int8_t bme680_get_regs(uint8_t reg_addr, uint8_t *reg_data, uint16_t len, struct bme680_dev *dev)
{
    int8_t status;
    status = null_ptr_check(dev);
    if (status == BME680_OK)
    {
        dev->com_status = dev->read(dev->dev_id, reg_addr, reg_data, len);
        if (dev->com_status != 0)
            status = BME680_E_COM_FAIL;
    }
    return status;
}
int8_t bme680_set_regs(const uint8_t *reg_addr, const uint8_t *reg_data, uint8_t len, struct bme680_dev *dev)
{
    int8_t status;
    uint16_t index;
    status = null_ptr_check(dev);
    if (status == BME680_OK)
    {
        if (len > 0)
        {
            /* Iterate and write each register-value pair */
            for (index = 0; index < len; index++)
            {
                dev->com_status = dev->write(dev->dev_id, reg_addr[index], (uint8_t *)&reg_data[index], 1);
                if (dev->com_status != BME680_OK)
                {
                    status = BME680_E_COM_FAIL;
                    break; /* Exit loop on first error */
                }
            }
        }
        else
        {
            /* Or handle len = 0 as no-op or error, BME680_E_INVALID_LENGTH if len is 0 or too large */
            /* Current Bosch API does not specify behavior for len = 0, assuming it's an invalid length */
            status = BME680_E_COM_FAIL;
        }
    }
    return status;
}

// Fonctions de configuration du capteur
int8_t bme680_set_sensor_settings(uint16_t desired_settings, struct bme680_dev *dev)
{
    int8_t status;
    uint8_t reg_addr;
    uint8_t data = 0;
    uint8_t count = 0;
    uint8_t reg_array[BME680_REG_BUFFER_LENGTH] = {0};
    uint8_t data_array[BME680_REG_BUFFER_LENGTH] = {0};
    uint8_t intended_power_mode = dev->power_mode;
    status = null_ptr_check(dev);
    if (status == BME680_OK)
    {
        if (desired_settings & BME680_GAS_MEAS_SEL)
            status = set_gas_config(dev);
        dev->power_mode = BME680_SLEEP_MODE;
        if (status == BME680_OK)
            status = bme680_set_sensor_mode(dev);
        if (desired_settings & BME680_FILTER_SEL)
        {
            status = boundary_check(&dev->tph_sett.filter, BME680_FILTER_SIZE_0, BME680_FILTER_SIZE_127, dev);
            reg_addr = BME680_CONF_ODR_FILT_ADDR;
            if (status == BME680_OK)
                status = bme680_get_regs(reg_addr, &data, 1, dev);
            if (desired_settings & BME680_FILTER_SEL)
                data = BME680_SET_BITS(data, BME680_FILTER, dev->tph_sett.filter);
            reg_array[count] = reg_addr;
            data_array[count] = data;
            count++;
        }
        if (desired_settings & BME680_HCNTRL_SEL)
        {
            status = boundary_check(&dev->gas_sett.heatr_ctrl, BME680_ENABLE_HEATER, BME680_DISABLE_HEATER, dev);
            reg_addr = BME680_CONF_HEAT_CTRL_ADDR;
            if (status == BME680_OK)
                status = bme680_get_regs(reg_addr, &data, 1, dev);
            data = BME680_SET_BITS_POS_0(data, BME680_HCTRL, dev->gas_sett.heatr_ctrl);
            reg_array[count] = reg_addr;
            data_array[count] = data;
            count++;
        }
        if (desired_settings & (BME680_OST_SEL | BME680_OSP_SEL))
        {
            status = boundary_check(&dev->tph_sett.os_temp, BME680_OS_NONE, BME680_OS_16X, dev);
            reg_addr = BME680_CONF_T_P_MODE_ADDR;
            if (status == BME680_OK)
                status = bme680_get_regs(reg_addr, &data, 1, dev);
            if (desired_settings & BME680_OST_SEL)
                data = BME680_SET_BITS(data, BME680_OST, dev->tph_sett.os_temp);
            if (desired_settings & BME680_OSP_SEL)
                data = BME680_SET_BITS(data, BME680_OSP, dev->tph_sett.os_pres);
            reg_array[count] = reg_addr;
            data_array[count] = data;
            count++;
        }
        if (desired_settings & BME680_OSH_SEL)
        {
            status = boundary_check(&dev->tph_sett.os_hum, BME680_OS_NONE, BME680_OS_16X, dev);
            reg_addr = BME680_CONF_OS_H_ADDR;
            if (status == BME680_OK)
                status = bme680_get_regs(reg_addr, &data, 1, dev);
            data = BME680_SET_BITS_POS_0(data, BME680_OSH, dev->tph_sett.os_hum);
            reg_array[count] = reg_addr;
            data_array[count] = data;
            count++;
        }
        if (desired_settings & (BME680_RUN_GAS_SEL | BME680_NBCONV_SEL))
        {
            status = boundary_check(&dev->gas_sett.run_gas, BME680_RUN_GAS_DISABLE, BME680_RUN_GAS_ENABLE, dev);
            if (status == BME680_OK)
            {
                status = boundary_check(&dev->gas_sett.nb_conv, BME680_NBCONV_MIN, BME680_NBCONV_MAX, dev);
            }
            reg_addr = BME680_CONF_ODR_RUN_GAS_NBC_ADDR;
            if (status == BME680_OK)
                status = bme680_get_regs(reg_addr, &data, 1, dev);
            if (desired_settings & BME680_RUN_GAS_SEL)
                data = BME680_SET_BITS(data, BME680_RUN_GAS, dev->gas_sett.run_gas);
            if (desired_settings & BME680_NBCONV_SEL)
                data = BME680_SET_BITS_POS_0(data, BME680_NBCONV, dev->gas_sett.nb_conv);
            reg_array[count] = reg_addr;
            data_array[count] = data;
            count++;
        }
        if (status == BME680_OK)
            status = bme680_set_regs(reg_array, data_array, count, dev);
        dev->power_mode = intended_power_mode;
    }
    return status;
}
int8_t bme680_get_sensor_settings(uint16_t desired_settings, struct bme680_dev *dev)
{
    int8_t status;
    /* starting address of the register array for burst read*/
    uint8_t reg_addr = BME680_CONF_HEAT_CTRL_ADDR;
    uint8_t data_array[BME680_REG_BUFFER_LENGTH] = {0};

    /* Check for null pointer in the device structure*/
    status = null_ptr_check(dev);
    if (status == BME680_OK)
    {
        status = bme680_get_regs(reg_addr, data_array, BME680_REG_BUFFER_LENGTH, dev);

        if (status == BME680_OK)
        {
            if (desired_settings & BME680_GAS_MEAS_SEL)
                status = get_gas_config(dev);

            /* get the T,P,H ,Filter,ODR settings here */
            if (desired_settings & BME680_FILTER_SEL)
                dev->tph_sett.filter = BME680_GET_BITS(data_array[BME680_REG_FILTER_INDEX],
                                                       BME680_FILTER);

            if (desired_settings & (BME680_OST_SEL | BME680_OSP_SEL))
            {
                dev->tph_sett.os_temp = BME680_GET_BITS(data_array[BME680_REG_TEMP_INDEX], BME680_OST);
                dev->tph_sett.os_pres = BME680_GET_BITS(data_array[BME680_REG_PRES_INDEX], BME680_OSP);
            }

            if (desired_settings & BME680_OSH_SEL)
                dev->tph_sett.os_hum = BME680_GET_BITS_POS_0(data_array[BME680_REG_HUM_INDEX],
                                                             BME680_OSH);

            /* get the gas related settings */
            if (desired_settings & BME680_HCNTRL_SEL)
                dev->gas_sett.heatr_ctrl = BME680_GET_BITS_POS_0(data_array[BME680_REG_HCTRL_INDEX],
                                                                 BME680_HCTRL);

            if (desired_settings & (BME680_RUN_GAS_SEL | BME680_NBCONV_SEL))
            {
                dev->gas_sett.nb_conv = BME680_GET_BITS_POS_0(data_array[BME680_REG_NBCONV_INDEX],
                                                              BME680_NBCONV);
                dev->gas_sett.run_gas = BME680_GET_BITS(data_array[BME680_REG_RUN_GAS_INDEX],
                                                        BME680_RUN_GAS);
            }
        }
    }
    else
    {
        status = BME680_E_NULL_PTR;
    }

