weedmanu/STM32_Libraries/STM32_BME680/STM32_BME680.c
    return status;
}
int8_t BME680_Config_Advanced(struct bme680_dev *dev, struct bme680_tph_sett *tph_settings, struct bme680_gas_sett *gas_settings, uint8_t power_mode)
{
    uint16_t desired_settings = BME680_OST_SEL | BME680_OSP_SEL | BME680_OSH_SEL | BME680_FILTER_SEL | BME680_GAS_SENSOR_SEL;

    dev->tph_sett = *tph_settings;
    dev->gas_sett = *gas_settings;
    dev->power_mode = power_mode;

    return bme680_set_sensor_settings(desired_settings, dev);
}
void bme680_set_profile_dur(uint16_t duration, struct bme680_dev *dev)
{
    uint16_t tph_profile_duration;

    tph_profile_duration = calculate_tph_measurement_duration(dev);
    dev->gas_sett.heatr_dur = duration - tph_profile_duration;
}
void bme680_get_profile_dur(uint16_t *duration, const struct bme680_dev *dev)
{
    uint16_t tph_profile_duration;

    if (duration == NULL || dev == NULL)
    {
        return; /* Or handle error appropriately */
    }

    tph_profile_duration = calculate_tph_measurement_duration(dev);

    *duration = tph_profile_duration;

    if (dev->gas_sett.run_gas)
    {
        *duration += dev->gas_sett.heatr_dur;
    }
}

// Fonction de mise en veille du capteur
int8_t bme680_set_sensor_mode(struct bme680_dev *dev)
{
    int8_t status;
    uint8_t tmp_pow_mode;
    uint8_t pow_mode = 0;
    uint8_t reg_addr = BME680_CONF_T_P_MODE_ADDR;

    status = null_ptr_check(dev);
    if (status == BME680_OK)
    {
        do
        {
            status = bme680_get_regs(BME680_CONF_T_P_MODE_ADDR, &tmp_pow_mode, 1, dev);
            if (status == BME680_OK)
            {
                pow_mode = (tmp_pow_mode & BME680_MODE_MSK);

                if (pow_mode != BME680_SLEEP_MODE)
                {
                    tmp_pow_mode = tmp_pow_mode & (~BME680_MODE_MSK);
                    status = bme680_set_regs(&reg_addr, &tmp_pow_mode, 1, dev);
                    dev->delay_ms(BME680_POLL_PERIOD_MS);
                }
            }
        } while (pow_mode != BME680_SLEEP_MODE);

        if (dev->power_mode != BME680_SLEEP_MODE)
        {
            tmp_pow_mode = (tmp_pow_mode & ~BME680_MODE_MSK) | (dev->power_mode & BME680_MODE_MSK);
            if (status == BME680_OK)
                status = bme680_set_regs(&reg_addr, &tmp_pow_mode, 1, dev);
        }
    }

    return status;
}
int8_t bme680_get_sensor_mode(struct bme680_dev *dev)
{
    int8_t status;
    uint8_t mode;

    status = null_ptr_check(dev);
    if (status == BME680_OK)
    {
        status = bme680_get_regs(BME680_CONF_T_P_MODE_ADDR, &mode, 1, dev);
        dev->power_mode = mode & BME680_MODE_MSK;
    }

    return status;
}

// Fonction de lecture des données du capteur
int8_t bme680_get_sensor_data(struct bme680_field_data *data, struct bme680_dev *dev)
{
    int8_t status;

    status = null_ptr_check(dev);
    if (status == BME680_OK)
    {
        status = read_field_data(data, dev);
        if (status == BME680_OK)
        {
            if (data->status & BME680_NEW_DATA_MSK)
                dev->new_fields = 1;
            else
                dev->new_fields = 0;
        }
    }

    return status;
}

// Fonction de démarrage du capteur
int8_t bme680_soft_reset(struct bme680_dev *dev)
{
    int8_t status;
    uint8_t reg_addr = BME680_SOFT_RESET_ADDR;
    uint8_t soft_rst_cmd = BME680_SOFT_RESET_CMD;
    status = null_ptr_check(dev);
    if (status == BME680_OK)
    {
        status = bme680_set_regs(&reg_addr, &soft_rst_cmd, 1, dev);
        dev->delay_ms(BME680_RESET_PERIOD);
    }
    return status;
}
int8_t bme680_init(struct bme680_dev *dev)
{
    int8_t status;
    status = null_ptr_check(dev);
    if (status == BME680_OK)
    {
        status = bme680_soft_reset(dev);
        if (status == BME680_OK)
        {
            status = bme680_get_regs(BME680_CHIP_ID_ADDR, &dev->chip_id, 1, dev);
            if (status == BME680_OK)
            {
                if (dev->chip_id == BME680_CHIP_ID)
                {
                    status = get_calib_data(dev);
                    if (status == BME680_OK)
                    {
                        dev->tph_sett.os_hum = BME680_OS_1X;
                        dev->tph_sett.os_pres = BME680_OS_1X;
                        dev->tph_sett.os_temp = BME680_OS_1X;
                        dev->tph_sett.filter = BME680_FILTER_SIZE_0;
                        dev->gas_sett.run_gas = BME680_RUN_GAS_DISABLE;
                        dev->gas_sett.nb_conv = 0;
                        dev->gas_sett.heatr_temp = 0;
                        dev->gas_sett.heatr_dur = 0;
                    }
                }
                else
                {
                    status = BME680_E_DEV_NOT_FOUND;
                }
            }
        }
    }
    return status;
}
int8_t BME680_Start(struct bme680_dev *dev, I2C_HandleTypeDef *i2c_handle,
                    const BME680_InitialSettings *settings)
{
    int8_t status = BME680_E_DEV_NOT_FOUND;
    /* int attempt_count = 0; // No longer needed here */
    if (!dev || !i2c_handle)
    {
        return BME680_E_NULL_PTR;
    }

    s_bme680_i2c_handle = i2c_handle;
    dev->hi2c = i2c_handle;
    dev->read = stm32_bme680_i2c_read;
    dev->write = stm32_bme680_i2c_write;
    dev->delay_ms = user_delay_ms; // Utilisation directe de user_delay_ms
    dev->intf = BME680_I2C_INTF;

    /* Try initializing with the primary I2C address */
    status = sensor_init(dev, BME680_I2C_ADDR_PRIMARY, settings);
    if (status == BME680_OK)
    {
        return BME680_OK;
    }

    /* If primary address fails, try the secondary I2C address */
    status = sensor_init(dev, BME680_I2C_ADDR_SECONDARY, settings);
    if (status == BME680_OK)
    {
        return BME680_OK;
    }

    /* If both addresses fail, cleanup and return the last error status */
    s_bme680_i2c_handle = NULL; /* Clear the global handle as initialization failed */
    return status;
}

// Fonction pour le calcul de l'IAQ
float waterSatDensity(float temp)
{
    return (6.112 * 100 * exp((17.62 * temp) / (243.12 + temp))) / (461.52 * (temp + 273.15));
}
float getIAQ(IAQTracker *tracker, BME680Data bme_data)
{
    float temp = bme_data.temperature;
    float hum = bme_data.humidity;
    float R_gas = bme_data.gas_resistance;

    float rho_max = waterSatDensity(temp);
    float hum_abs = (hum / 100.0f) * 1000.0f * rho_max;

    float comp_gas = R_gas * expf(tracker->slope * hum_abs);

