weedmanu/STM32_Libraries/STM32_BME680/STM32_BME680.c
    tracker->gas_cal_data[tracker->gas_cal_data_idx] = comp_gas;
    tracker->gas_cal_data_idx = (tracker->gas_cal_data_idx + 1) % GAS_CAL_DATA_WINDOW_SIZE;
    if (tracker->gas_cal_data_filled_count < GAS_CAL_DATA_WINDOW_SIZE)
    {
        tracker->gas_cal_data_filled_count++;
    }

    if (tracker->gas_cal_data_filled_count > 0)
    {
        float sum = 0.0f;
        for (int i = 0; i < tracker->gas_cal_data_filled_count; i++)
        {
            sum += tracker->gas_cal_data[i];
        }
        tracker->gas_baseline = sum / tracker->gas_cal_data_filled_count;
    }
    else
    {
        tracker->gas_baseline = comp_gas;
    }

    if (tracker->burn_in_cycles_remaining > 0)
    {
        tracker->burn_in_cycles_remaining--;
        return NAN;
    }
    else
    {
        if (tracker->gas_baseline == 0.0f)
        {
            return (comp_gas == 0.0f) ? 0.0f : 100.0f;
        }

        float ratio = comp_gas / tracker->gas_baseline;
        float iaq_contribution_gas = powf(ratio, 2.0f);

        float AQ = (1.0f - fminf(iaq_contribution_gas, 1.0f)) * 100.0f;

        if (AQ < 0.0f)
            AQ = 0.0f;
        if (AQ > 100.0f)
            AQ = 100.0f;

        return AQ;
    }
}
const char *getIAQCategory(float iaq)
{
    if (iaq <= 20)
    {
        return "Excellent";
    }
    else if (iaq <= 40)
    {
        return "Bon";
    }
    else if (iaq <= 60)
    {
        return "Modéré";
    }
    else if (iaq <= 80)
    {
        return "Médiocre";
    }
    else
    {
        return "Mauvais";
    }
}
void initIAQTracker(IAQTracker *tracker, int burn_in_total_cycles, float ph_slope)
{
    tracker->slope = ph_slope;
    tracker->burn_in_cycles_remaining = burn_in_total_cycles;
    for (int i = 0; i < GAS_CAL_DATA_WINDOW_SIZE; ++i)
    {
        tracker->gas_cal_data[i] = 0.0f;
    }
    tracker->gas_cal_data_idx = 0;
    tracker->gas_cal_data_filled_count = 0;
    tracker->gas_baseline = 0.0f;
}

// Fonction de temporisation
void user_delay_ms(uint32_t period)
{
    HAL_Delay(period);
}
